const Joi = require("joi");
module.exports = {
    /*usser*/
    mobile : 'فیلد شماره همراه نباید خالی باشد',
    code : 'فیلد عنوان نباید خالی باشد',
    name : 'فیلد نام نباید خالی باشد',
    desc : 'فیلد توضیحات نباید خالی باشد',
    userId : 'لطفاابتدا وارد حساب کاربری خود شوید!',
    rate : 'به محصول امتیاز بده !',
    qty : 'فیلد تعداد نباید خالی باشد',
    catId : 'دسته بندی را انتخاب کنید',
    brandId : 'برند را انتخاب کنید',
    family : 'فیلد نام خانوادگی نباید خالی باشد',
    role : 'فیلد نقش نباید خالی باشد',
    password : 'فیلد رمز عبور نباید خالی باشد',
    key : 'فیلد  نباید خالی باشد',
    value : 'مقدار فیلد نباید خالی باشد',
    /*dore*/
    title : 'فیلد عنوان نباید خالی باشد',
    duration: 'فیلد زمان نباید خالی باشد',
    price: 'فیلد قیمت نباید خالی باشد',
    pic: 'فیلد عکس نباید خالی باشد',
    author: 'فیلد نویسنده نباید خالی باشد',
    cat: 'فیلد دسته بندی نباید خالی باشد',
    sms : "ارسال پیامک با مشکل مواجه شد",
    wrongcode : 'کد تایید اشتباه است',
    wronglogin : 'موبایل یا رمز عبور اشتباه است',
    passchange : 'رمز عبور با موفقیت تغییر کرد',
    delete : 'حذف با موفقیت انجام شد!',
    put : 'بروزرسانی با موفقیت انجام شد!',
    create : 'ساخت با موفقیت انجام شد!',
    addCart : 'محصول با موفقیت به سبد خرید اضافه شد',
    removeCart : 'محصول با موفقیت از سبد خرید حذف شد',
    removeAllCart : 'محصولات با موفقیت از سبد خرید حذف شدند',

//
}
